<?php

namespace Database\Seeders;

use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;
use App\Models\Activity;

class ActivitySeeder extends Seeder
{

    public function run(): void
    {
        Activity::create([
            'activity_type_id' => 1,
            'activity_name' => 'พิพิธภัณฑ์ธรรมชาติวิทยา',
            'description' => 'จัดแสดงนิทรรศการประวัติศาสตร์ทางธรรมชาติวิทยานับตั้งแต่การกำเนิดโลกสิ่งมีชีวิต ความหลากหลายทางชีวภาพ โดยผู้เข้าชมสามารถมีส่วนร่วมในการเรียนรู้และค้นหาคำตอบได้ด้วยตนเอง ผ่านชิ้นงานทางวิทยาศาสตร์และสื่อประสมที่สามารถโต้ตอบกับผู้เข้าชมได้ โดยเนื้อหาการจัดแสดงเน้นการนำเสนอข้อมูลทรัพยากรสำคัญที่พบในภาคตะวันออกเฉียงเหนือ',
            'children_price' => 10,
            'student_price' => 30,
            'adult_price' => 50,
            'max_capacity' => 250,
        ]);
        Activity::create([
            'activity_type_id' => 1,
            'activity_name' => 'พิพิธภัณฑ์วิทยาศาสตร์',
            'description' => 'จัดแสดงนิทรรศการด้านวิทยาศาสตร์และเทคโนโลยี พื้นที่กว่า 12,000 ตร.ม. ที่มีทั้งเรื่องราวของภูมิปัญญาวิถีไทยพัฒนาเป็นองค์ความรู้ที่เข้ากับชีวิตประจำวัน, พลังงานธรรมชาติ, การเทคโนโลยีในชีวิตประจำวัน เเละจำลองรูปแบบการใช้เทคโนโลยีในอนาคตเป็นอีกหนึ่งสถานที่ที่เหมาะกับทุกวัย',
            'children_price' => 10,
            'student_price' => 30,
            'adult_price' => 50,
            'max_capacity' => 250,
        ]);
        Activity::create([
            'activity_type_id' => 1,
            'activity_name' => 'เข้าชมทั้งสองพิพิธภัณฑ์ (ธรรมชาติวิทยา และวิทยาศาสตร์)',
            'description' => 'จัดแสดงนิทรรศการประวัติศาสตร์ทางธรรมชาติวิทยานับตั้งแต่การกำเนิดโลกสิ่งมีชีวิต ความหลากหลายทางชีวภาพ โดยผู้เข้าชมสามารถมีส่วนร่วมในการเรียนรู้และค้นหาคำตอบได้ด้วยตนเอง ผ่านชิ้นงานทางวิทยาศาสตร์และสื่อประสมที่สามารถโต้ตอบกับผู้เข้าชมได้ โดยเนื้อหาการจัดแสดงเน้นการนำเสนอข้อมูลทรัพยากรสำคัญที่พบในภาคตะวันออกเฉียงเหนือ จัดแสดงนิทรรศการด้านวิทยาศาสตร์และเทคโนโลยี พื้นที่กว่า 12,000 ตร.ม. ที่มีทั้งเรื่องราวของภูมิปัญญาวิถีไทยพัฒนาเป็นองค์ความรู้ที่เข้ากับชีวิตประจำวัน, พลังงานธรรมชาติ, การเทคโนโลยีในชีวิตประจำวัน เเละจำลองรูปแบบการใช้เทคโนโลยีในอนาคตเป็นอีกหนึ่งสถานที่ที่เหมาะกับทุกวัย',
            'children_price' => 15,
            'student_price' => 50,
            'adult_price' => 80,
            'max_capacity' => 500,
        ]);
    }
}
