<!-- Modal PDPA Pilicy-->
<div class="modal fade" id="privacyModal" tabindex="-1" aria-labelledby="privacyModalLabel">
    <div class="modal-dialog modal-lg">
        <div class="modal-content">
            <div class="modal-header">
                <h5 class="modal-title" id="privacyModalLabel">นโยบายความเป็นส่วนตัว</h5>
                <button type="button" class="btn-close" data-bs-dismiss="modal" aria-label="Close"></button>
            </div>
            <div class="modal-body">
                <!-- Tabs -->
                <ul class="nav nav-tabs" id="privacyTabs" role="tablist">
                    <li class="nav-item" role="presentation">
                        <button class="nav-link active" id="tab1-tab" data-bs-toggle="tab" data-bs-target="#tab1"
                            type="button" role="tab">
                            นโยบายความเป็นส่วนตัวของข้อมูล
                        </button>
                    </li>
                    <li class="nav-item" role="presentation">
                        <button class="nav-link" id="tab2-tab" data-bs-toggle="tab" data-bs-target="#tab2" type="button"
                            role="tab">
                            การจัดเก็บข้อมูลส่วนบุคคล
                        </button>
                    </li>
                    <li class="nav-item" role="presentation">
                        <button class="nav-link" id="tab3-tab" data-bs-toggle="tab" data-bs-target="#tab3" type="button"
                            role="tab">
                            สิทธิของเจ้าของข้อมูลส่วนบุคคล
                        </button>
                    </li>
                </ul>
                <!-- Tab Content -->
                <div class="tab-content mt-3" id="privacyTabsContent" style="max-height: 400px; overflow-y: auto;">
                    <div class="tab-pane fade show active" id="tab1" role="tabpanel">
                        <h4 data-v-4a52c7d2="">นโยบายความเป็นส่วนตัวของข้อมูล (Privacy Policy)</h4>
                        <p data-v-4a52c7d2="">เว็บไซต์ระบบจองเข้าชมพิพิธภัณฑ์
                            ศูนย์พิพิธภัณฑ์และแหล่งเรียนรู้ตลอดชีวิต
                            มหาวิทยาลัยขอนแก่น (reserve-museum.kku.ac.th)
                            เคารพสิทธิความเป็นส่วนตัวของผู้ใช้ทุกคนที่เข้าเว็บไซต์ของเรา
                            จึงขอชี้แจงให้ท่านทราบเกี่ยวกับการใช้งานข้อมูลส่วนบุคคลของท่าน
                        </p>
                        <p data-v-4a52c7d2="">ประกาศนโยบายความเป็นส่วนตัวนี้ใช้สำหรับบุคคลดังต่อไปนี้</p>
                        <ul data-v-4a52c7d2="">
                            <li data-v-4a52c7d2="">ผู้ให้บริการหรือเจ้าของเว็บไซต์
                                ต่อไปนี้จะเรียกว่าระบบจองเข้าชมพิพิธภัณฑ์
                            </li>
                            <li data-v-4a52c7d2="">ผู้เยี่ยมชมเว็บไซต์ คือ ผู้ที่เปิดหน้าเว็บไซต์ หรือ
                                อ่านข้อมูลบนหน้าเว็บไซต์
                                ระบบจองเข้าชมพิพิธภัณฑ์ไม่ว่าจะเป็นหน้าใดก็ตาม</li>
                            <li data-v-4a52c7d2="">ผู้ใช้บริการเว็บไซต์ ได้แก่ ผู้จองเข้าชมพิพิธภัณฑ์</li>
                        </ul>
                        <p data-v-4a52c7d2="">เว็บไซต์ระบบจองเข้าชมพิพิธภัณฑ์
                            ได้กำหนดนโยบายเกี่ยวกับข้อมูลส่วนบุคคลเพื่อยกระดับมาตรฐาน ความปลอดภัย ของข้อมูลส่วนบุคคล
                            ของผู้เยี่ยมชม และ ผู้ใช้บริการเว็บไซต์ให้ดียิ่งขึ้น และ
                            เพื่อให้สอดคล้องกับพระราชบัญญัติ
                            คุ้มครองข้อมูลส่วนบุคคล พ.ศ. 2562</p>
                        <p data-v-4a52c7d2="">ดังนั้น เราขอแนะนำให้ท่านอ่านนโยบายคุ้มครองข้อมูลส่วนบุคคลฉบับนี้
                            เพื่อเรียนรู้และเข้าใจหลักปฏิบัติที่เว็บไซต์ระบบจองเข้าชมพิพิธภัณฑ์
                            ยึดถือในการปฏิบัติต่อข้อมูลส่วนบุคคลของท่าน
                        </p>
                    </div>
                    <div class="tab-pane fade" id="tab2" role="tabpanel">
                        <h4 data-v-4a52c7d2="">วัตถุประสงค์ของการจัดเก็บข้อมูลส่วนบุคคล</h4>
                        <p data-v-4a52c7d2="">ระบบจองเข้าชมพิพิธภัณฑ์เก็บข้อมูลส่วนบุคคลของท่านตามวัตถุประสงค์
                            ของการดำเนินงานเว็บไซต์ดังนี้</p>
                        <ul data-v-4a52c7d2="">
                            <li data-v-4a52c7d2="">เพื่อใช้เป็นข้อมูลในการติดต่อกลับผู้ใช้บริการเว็บไซต์</li>
                        </ul>
                        <h4 data-v-4a52c7d2="">ข้อมูลส่วนบุคคลที่เว็บไซต์ระบบจองเข้าชมพิพิธภัณฑ์จัดเก็บ</h4>
                        <p data-v-4a52c7d2="">เว็บไซต์ระบบจองเข้าชมพิพิธภัณฑ์ จัดเก็บข้อมูลส่วนบุคคลของท่าน
                            ผ่านการใช้บริการเว็บไซต์ และ การลงทะเบียนโดยข้อมูลที่เราจัดเก็บมีดังนี้</p>
                        <ul data-v-4a52c7d2="">
                            <li data-v-4a52c7d2="">ชื่อ - นามสกุล ของผู้ใช้บริการเว็บไซต์</li>
                            <li data-v-4a52c7d2="">อีเมล ของผู้ใช้บริการเว็บไซต์</li>
                            <li data-v-4a52c7d2="">เบอร์โทรศัพท์ ของผู้ใช้บริการเว็บไซต์</li>
                        </ul>
                    </div>
                    <div class="tab-pane fade" id="tab3" role="tabpanel">
                        <h4 data-v-4a52c7d2="">สิทธิของเจ้าของข้อมูลส่วนบุคคล</h4>
                        <ul data-v-4a52c7d2="">
                            <li data-v-4a52c7d2="">ผู้ใช้บริการเว็บไซต์มีสิทธิ์ที่จะขอลบข้อมูล
                                ที่ลงทะเบียนอยู่ในระบบ
                                โดยสามารถแจ้งความประสงค์ในการลบข้อมูลได้
                                ตามช่องทางติดต่อในหัวข้อการติดต่อในนโยบายนี้
                            </li>
                        </ul>
                        <h4 data-v-4a52c7d2="">ความปลอดภัยของข้อมูลส่วนบุคคล</h4>
                        <p data-v-4a52c7d2="">เว็บไซต์ระบบจองเข้าชมพิพิธภัณฑ์ ให้ความสำคัญกับข้อมูลส่วนตัวของท่าน
                            และจะใช้มาตรการที่มีประสิทธิภาพเพื่อคุ้มครองข้อมูลของท่านให้ปลอดภัยอยู่เสมอ ดังนั้น
                            เราจึงได้ใช้เทคโนโลยี และกำหนดนโยบายต่างๆ ขึ้นมา
                            โดยมีวัตถุประสงค์ที่จะคุ้มครองข้อมูลส่วนตัวของท่านให้ปลอดภัยจากการลักลอบเข้าถึงข้อมูลโดยไม่ได้รับอนุญาต
                            และจากการนำข้อมูลไปใช้ในทางที่ไม่เหมาะสม เราจะใช้เทคโนโลยีใหม่ที่สามารถหาได้ ณ
                            ขณะที่เราพัฒนาเว็บไซต์
                            เพื่อปรับปรุงมาตรการเหล่านี้ให้มีประสิทธิภาพมากยิ่งขึ้นในเวลาอันสมควร
                        </p>
                        <h4 data-v-4a52c7d2="">ท่านจะติดต่อระบบจองเข้าชมพิพิธภัณฑ์
                            และเจ้าหน้าที่คุ้มครองข้อมูลส่วนบุคคล
                            ได้อย่างไร</h4>
                        <p data-v-4a52c7d2="">หากท่านมีข้อเสนอแนะ
                            หรือต้องการสอบถามข้อมูลเกี่ยวกับรายละเอียดการเก็บรวบรวม ใช้
                            และ/หรือเปิดเผยข้อมูลส่วนบุคคลของท่าน รวมถึงการขอใช้สิทธิตามนโยบายฉบับนี้
                            ท่านสามารถติดต่อ
                            ผ่านช่องทางต่อไปนี้</p>
                        <ul data-v-4a52c7d2="">
                            <li data-v-4a52c7d2=""><a href="https://web.facebook.com/kkumuseum?locale=th_TH"
                                    data-v-4a52c7d2="">Facebook: ศูนย์พิพิธภัณฑ์และแหล่งเรียนรู้ตลอดชีวิต
                                    มหาวิทยาลัยขอนแก่น
                                </a></li>
                        </ul>
                        <p data-v-4a52c7d2="">จัดทำนโยบายโดย ระบบจองเข้าชมพิพิธภัณฑ์
                            ศูนย์พิพิธภัณฑ์และแหล่งเรียนรู้ตลอดชีวิต
                            มหาวิทยาลัยขอนแก่น (reserve-museum.kku.ac.th)</p>
                    </div>
                </div>
            </div>
            <div class="modal-footer">
                <button type="button" class="btn btn-secondary" data-bs-dismiss="modal">ปิด</button>
            </div>
        </div>
    </div>
</div>